In [1]:
import pandas as pd

In [ ]:
dados = pd.read_excel(r'C:\curso-eng-dados\Python-SGBDS\Origem de Dados\arquivos_excel\Produto.xlsx')
dados.head()

   ID                  Name  Price  Id_Category
0   0       Sapato vermelho     96            0
1   1  Bolsa mais que Velha   8000            0
2   2                 Calça     75            0
3   3    Camisa apertadinha    170            0
4   4   Vestido Super curto     57            0

In [ ]:
# ordem crescente coluna especifica
dados = dados.sort_values(by=['Name'])

In [ ]:
# ordem crescente coluna especifica
dados = dados.sort_values(by=['Name'],ascending=True)

In [ ]:
# ordem crescente coluna especifica
dados = dados.sort_values(by=['Name'],ascending=False)

Renomeando colunas

In [5]:
dados = pd.read_excel(r'C:\curso-eng-dados\Python-SGBDS\Origem de Dados\arquivos_excel\Produto.xlsx')
dados.head()

   ID                  Name  Price  Id_Category
0   0       Sapato vermelho     96            0
1   1  Bolsa mais que Velha   8000            0
2   2                 Calça     75            0
3   3    Camisa apertadinha    170            0
4   4   Vestido Super curto     57            0

In [ ]:
# Renomeando coluna
dados = dados.rename(columns={'Name':'Nome'})
#[] lista
#{} dicionario

In [7]:
dados.head()

   ID                  Nome  Price  Id_Category
0   0       Sapato vermelho     96            0
1   1  Bolsa mais que Velha   8000            0
2   2                 Calça     75            0
3   3    Camisa apertadinha    170            0
4   4   Vestido Super curto     57            0

modo com variável

In [ ]:
dados = pd.read_excel(r'C:\curso-eng-dados\Python-SGBDS\Origem de Dados\arquivos_excel\Produto.xlsx')
dados.head()

In [8]:
# Cria uma dicionario com os nomes das colunas anigos e novos
novascolunas = {'Name':'Nome','Price':'Valor'}
dados = dados.rename(columns=novascolunas)
dados.head()

   ID                  Nome  Valor  Id_Category
0   0       Sapato vermelho     96            0
1   1  Bolsa mais que Velha   8000            0
2   2                 Calça     75            0
3   3    Camisa apertadinha    170            0
4   4   Vestido Super curto     57            0

Dados resumidos

In [9]:
import pandas as pd

In [10]:
dados = pd.read_excel(r'C:\curso-eng-dados\Python-SGBDS\Origem de Dados\arquivos_excel\Produto.xlsx')
novascolunas = {'Name':'Nome','Price':'Valor','Id_Category':'IdCategoria'}
dados = dados.rename(columns=novascolunas)
dados.head()

   ID                  Nome  Valor  IdCategoria
0   0       Sapato vermelho     96            0
1   1  Bolsa mais que Velha   8000            0
2   2                 Calça     75            0
3   3    Camisa apertadinha    170            0
4   4   Vestido Super curto     57            0